Revit 2026 API

# Rectangle Methods

---

The Rectangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsNormalized | Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Rectangle Class

Autodesk.Revit.DB Namespace